# ─── Taps ─────────────────────────────────────────────────────────────────────
tap "homebrew/bundle"
tap "homebrew/cask"
tap "Gentleman-Programming/tap"
tap "nikitabobko/tap"

# ─── CLI Tools ────────────────────────────────────────────────────────────────
brew "git"
brew "gh"                    # GitHub CLI
brew "lazygit"               # Git TUI
brew "bat"                   # cat con syntax highlighting
brew "fd"                    # find moderno
brew "eza"                   # ls moderno

# ─── Zsh ──────────────────────────────────────────────────────────────────────
brew "zsh-syntax-highlighting"
brew "zsh-autosuggestions"

# ─── Runtimes ─────────────────────────────────────────────────────────────────
brew "node"
brew "openjdk"               # Java — symlink manual requerido post-install

# ─── Apps ─────────────────────────────────────────────────────────────────────
cask "visual-studio-code"
cask "orbstack"              # Solo macOS — omitir en Linux
cask "insomnia"
cask "opencode"
cask "nikitabobko/tap/aerospace"  # Window manager — Solo macOS
cask "homerow"                    # Keyboard navigation — Solo macOS
cask "mole"                       # SSH tunnel manager — Solo macOS

# ─── Fuentes ──────────────────────────────────────────────────────────────────
tap "homebrew/cask-fonts"
cask "font-jetbrains-mono-nerd-font"
