# ─── Taps ─────────────────────────────────────────────────────────────────────
tap "gentleman-programming/tap"
tap "gromgit/fuse"
tap "nikitabobko/tap"
tap "supabase/tap"

# ─── CLI Base ─────────────────────────────────────────────────────────────────
brew "atuin"                 # Historial shell mejorado
brew "bat"                   # cat con syntax highlighting
brew "bottom"                # Monitor de procesos
brew "carapace"              # Autocompletado multi-shell
brew "coreutils"             # Utilidades GNU
brew "curl"                  # HTTP CLI
brew "eza"                   # ls moderno
brew "fastfetch"             # Resumen del sistema
brew "fd"                    # find moderno
brew "fzf"                   # Búsqueda difusa
brew "gh"                    # GitHub CLI
brew "git"                   # Git
brew "gum"                   # UI para scripts shell
brew "lazygit"               # Git TUI
brew "mole"                  # Gestión de túneles SSH
brew "ripgrep"               # grep moderno
brew "tree"                  # Árbol de directorios
brew "zellij"                # Multiplexor terminal
brew "zoxide"                # cd inteligente

# ─── Shell ────────────────────────────────────────────────────────────────────
brew "powerlevel10k"         # Theme de zsh
brew "zsh"                   # Shell principal
brew "zsh-autocomplete"      # Autocompletado en tiempo real
brew "zsh-autosuggestions"   # Sugerencias estilo fish
brew "zsh-syntax-highlighting"

# ─── Desarrollo e IA ──────────────────────────────────────────────────────────
brew "gentleman-programming/tap/engram"
brew "gentleman-programming/tap/gentle-ai"
brew "gentleman-programming/tap/gga"
brew "supabase/tap/supabase" # Supabase CLI

# ─── Runtimes ─────────────────────────────────────────────────────────────────
brew "node"                  # Next.js, Astro, Node
brew "openjdk"               # Java
brew "gromgit/fuse/sshfs-mac"

# ─── Apps macOS ───────────────────────────────────────────────────────────────
cask "nikitabobko/tap/aerospace"
cask "ghostty"
cask "homerow"
cask "macfuse"
cask "orbstack"
cask "tailscale-app"
cask "visual-studio-code"

# ─── Fuentes ──────────────────────────────────────────────────────────────────
cask "font-iosevka-term-nerd-font"
cask "font-jetbrains-mono-nerd-font"
